# Acquire Data for Classification

# Big Ideas

- Cache your data to speed up your data acquisition.

- Helper functions are your friends.

# Objectives 

**By the end of the acquire lesson and exercises, you will be able to...**

- **read data into a pandas DataFrame using the following modules:**

>pydataset
    
```python
from pydataset import data
df = data('dataset_name')
```
>seaborn datasets
    
```python
import seaborn as sns
df = sns.load_dataset('dataset_name')
```

- **read data into a pandas DataFrame from the following sources:**

    - an Excel spreadsheet

    - a Google sheet
    
    - Codeup's mySQL database

```python
pd.read_excel('file_name.xlsx', sheet_name='sheet_name')
pd.read_csv('filename.csv')
pd.read_sql(sql_query, connection_url)
```

- **use pandas methods and attributes to do some initial summarization and exploration of your data.**

```python
.head()
.shape
.info()
.columns
.dtypes
.describe()
.value_counts()
```

- **create functions that acquire data from Codeup's database, save the data locally to CSV files (cache your data), and check for CSV files upon subsequent use.**


- **create a new python module, `acquire.py`, that holds your functions that acquire the titanic and iris data and can be imported and called in other notebooks and scripts.**

In [1]:
import pandas as pd
import numpy as np
import os

# acquire
from env import host, user, password
from pydataset import data
import seaborn as sns

# turn off pink warning boxes
# warnings are good, actually.  Just messy when I'm trying to show y'all other stuff
import warnings
warnings.filterwarnings("ignore")

### 1. Create `df_iris`

- Use a python module (pydata or seaborn datasets) containing datasets as a source for the iris data.

In [2]:
# read documentation about the dataset
# data('iris', show_doc=True)

In [3]:
# Using pydataset

df_iris = data('iris')
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
# Using seaborn -- love the column names.

df_iris = sns.load_dataset('iris')
df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

### Print the first 3 rows.

In [37]:
print(df_iris.head(3))

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

### Print the number of rows and columns (shape).

In [6]:
df_iris.shape

(150, 5)

### Print the column names.

In [7]:
df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [8]:
# Return a nice list of columns if I want to grab and use them later.

df_iris.columns.to_list()

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [38]:
list(df_iris.columns)

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [39]:
list(df_iris)

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

### Print the data type of each column.

In [9]:
# Return just data types.

df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [10]:
# Return data types plus.

df_iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

### Print the summary statistics for each of the numeric variables.

In [42]:
# This method returns the summary statistics for numeric variables in my df.
# The .T function will transpose the DF to make it more readable

stats = df_iris.describe().T
stats

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

## 2. Create `df_google` 

- Read the data from a Google sheet into a dataframe, df_google.

[use this google sheet](https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357)

In [12]:
# Grab the Google sheet url.

sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

In [13]:
# Turn Google sheet address into a CSV export URL.

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [14]:
# Read in the data using the pandas `pd.read_csv()` function.

df_google = pd.read_csv(csv_export_url)

### Print the first 3 rows.

In [15]:
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### Print the number of rows and columns.

In [16]:
df_google.shape

(891, 12)

### Print the column names.

In [17]:
df_google.columns.to_list()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

### Print the data type of each column.

In [18]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [19]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Print the summary statistics for each of the numeric variables.

- Some of these numeric columns are really like encoded categorical values; at this stage, I'm just noting this observation.

In [20]:
df_google.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

### Print the unique values for each of your categorical variables.

- Some of these categorical variable columns have a ton of unique values, so I'll check the number first. If I want to see the unique values, I can do a `.value_counts()` on individual columns.

In [45]:
# I could get a count of unique values for each variable with an object data type.

for col in df_google.columns:
#     iterate through each string literal in the columns list
#     print(col)
    if df_google[col].dtypes == 'object':
        # if the string literal referened inside square brackets
        # points to a Series that has a dtypes that matches 'object':
        # we have an idea that this is a categorical data type,
        # and will then get the number of unique values in there 
        # using nunique
        if df_google[col].nunique() > 10:
            print(f'{col} has {df_google[col].nunique()} unique values.')
        else:
            print(f'{col} has the following unique values \n{df_google[col].unique()}')

Name has 891 unique values.
Sex has the following unique values
['male' 'female']
Ticket has 681 unique values.
Cabin has 147 unique values.
Embarked has the following unique values
['S' 'C' 'Q' nan]

In [22]:
df_google.Survived.value_counts(dropna=False)

0    549
1    342
Name: Survived, dtype: int64

In [23]:
df_google.Pclass.value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [47]:
# normalize will give us the proportion of the data
df_google.Sex.value_counts(dropna=False, normalize=True)

male      0.647587
female    0.352413
Name: Sex, dtype: float64

In [49]:
df_google.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [56]:
# we can check where our null values are
# by doing a isna or isnull check across our columns and rows depending on
# which axis we pass through the sum function
df_google.isnull().sum(axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

## 2. Create `df_excel`



- Read the `train` table from the `train.xlsx` file into a dataframe named `df_excel`.

In [26]:
df_excel = pd.read_excel('train.xlsx', sheet_name='train')

In [27]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Assign the first 100 rows to a new dataframe, `df_excel_sample`.

In [57]:
df_sample_clipboard = pd.read_clipboard()

In [58]:
df_sample_clipboard.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98 entries, 0 to 97
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  98 non-null     int64
 1   Survived     98 non-null     int64
 2   Pclass       98 non-null     int64
 3   Name         98 non-null     object
 4   Sex          98 non-null     object
 5   Age          76 non-null     float64
 6   SibSp        98 non-null     int64
 7   Parch        98 non-null     int64
 8   Ticket       98 non-null     object
 9   Fare         98 non-null     float64
 10  Cabin        20 non-null     object
 11  Embarked     97 non-null     object
dtypes: float64(2), int64(5), object(5)
memory usage: 9.3+ KB

In [28]:
df_excel_sample = df_excel.head(100)

In [29]:
df_excel_sample.shape

(100, 12)

### Print the number of rows of your original dataframe.

In [30]:
df_excel.shape[0]

891

In [59]:
len(df_excel)

891

### Print the first 5 column names.

In [31]:
df_excel.columns[:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

### Print the column names that have a data type of object.

In [68]:
# initiaize empty list
cat_cols = []
# for every entry in df_exel's columns:
for col in df_excel.columns:
    # print(col)
    #check the dtypes to be of the Object category
    # if so, append it into that list
    if df_excel[col].dtypes == 'O':
        cat_cols.append(col)

PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

In [69]:
cat_cols

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [72]:
# df_excel[['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']]
df_excel[cat_cols]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [71]:
df_excel.select_dtypes(include='object').head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [33]:
df_excel.select_dtypes(include='object').columns.tolist()

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

### Compute the range for each of the numeric variables.

In [34]:
# Some of these numeric columms are more like encoded categorical variables.

df_excel.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [35]:
# The two columns I want to know the range on are 'Age' and 'Fare'
# I can select just the true numeric variables to declutter my results.

titanic_stats = df_excel[['Age', 'Fare']].describe().T
titanic_stats

      count       mean        std   min      25%      50%   75%       max
Age   714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
Fare  891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [36]:
titanic_stats['range'] = titanic_stats['max'] - titanic_stats['min']
titanic_stats

,count,mean,std,min,25%,50%,75%,max,range
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000,79.5800
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292,512.3292

<hr style="border-top: 10px groove limegreen; margin-top: 1px; margin-bottom: 1px"></hr>

## `acquire.py` Functions

1. Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [75]:
# what do I want to do here?
# figure out my sql connection my mysql connection? 
# figure out what query I need
# use that query to make a function call that acquires my data
# implement caching to establish if my data is already present

In [78]:
def get_connection(schema,
                   user=user,
                   host=host,
                   password=password):
    '''
    get_conection will use a string-literal value associated with a 
    schema on the associated host present from the env file
    in order to establish a pymysql connection that will be
    formatted and conducive to pandas' read_sql function call
    '''
    return f'mysql+pymysql://{user}:{password}@{host}/{schema}'

In [85]:
def get_titanic_data():
    '''
    get_titanic_data will check to see if there is a local csv
    that contains titanic data, if not, will make a sql connection
    based on presented credentials of user, host, and password
    provided from an env.py file
    
    args: none
    return: a single pandas DataFrame
    '''
    # check to see if titanic.csv exists in our present directory
    if os.path.exists('titanic.csv'):
        #if that check returns the boolean True:
        # read in the file via pd.read_csv
        # and help point to where the index column is
        df = pd.read_csv('titanic.csv', index_col=0)
    else:
    #if that file is not here already:
        #define a query as a string-literal
        # that we checked in mysqlworkbench 
        query = 'SELECT * FROM passengers'
        # define a connection based on our get_connection
        #function that requires a single positional arg
        # associated with the schema name
        connection = get_connection('titanic_db')
        # use pd.read_sql to link that query and connection
        # return that into our variable df
        df = pd.read_sql(query, connection)
        # save the dataframe as a csv so os.path will return True
        # the next time we call the function
        #and it will merely read in the local csv instead of 
        #reconnecting to sql
        df.to_csv('titanic.csv')
    #now that we have a df one way or another at this point
    #go ahead and return the dataframe
    #so that we do not run into any funtional scope issues
    return df

In [88]:
df = get_titanic_data()

In [81]:
os.path.exists('titanic.csv')

True

In [80]:
# check to see if a file exists:
if os.path.exists('titanic.csv'):
      df = pd.read_csv('titanic.csv', index_col=0)
else:
    query = 'SELECT * FROM passengers'
    connection = get_connection('titanic_db')
    df = pd.read_sql(query, connection)
    df.to_csv('titanic.csv')

    Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [ ]:
query = '''SELECT measurement_id,
sepal_length,
sepal_width,
petal_width,
species_name
FROM measurements
LEFT JOIN species USING(species_id)'''
connection = get_connection('iris_db')

In [89]:
def get_iris_data():
    '''
    get_iris_data will check to see if there is a local csv
    that contains titanic data, if not, will make a sql connection
    based on presented credentials of user, host, and password
    provided from an env.py file
    
    args: none
    return: a single pandas DataFrame
    '''
    # check to see if titanic.csv exists in our present directory
    if os.path.exists('iris.csv'):
        #if that check returns the boolean True:
        # read in the file via pd.read_csv
        # and help point to where the index column is
        df = pd.read_csv('iris.csv', index_col=0)
    else:
    #if that file is not here already:
        #define a query as a string-literal
        # that we checked in mysqlworkbench 
        query = '''SELECT measurement_id,
        sepal_length,
        sepal_width,
        petal_width,
        species_name
        FROM measurements
        LEFT JOIN species USING(species_id)'''
        # define a connection based on our get_connection
        #function that requires a single positional arg
        # associated with the schema name
        connection = get_connection('iris_db')
        # use pd.read_sql to link that query and connection
        # return that into our variable df
        df = pd.read_sql(query, connection)
        # save the dataframe as a csv so os.path will return True
        # the next time we call the function
        #and it will merely read in the local csv instead of 
        #reconnecting to sql
        df.to_csv('iris.csv')
    #now that we have a df one way or another at this point
    #go ahead and return the dataframe
    #so that we do not run into any funtional scope issues
    return df

In [90]:
df_iris = get_iris_data()

In [92]:
df_iris.head()

   measurement_id  sepal_length  sepal_width  petal_width species_name
0               1           5.1          3.5          0.2       setosa
1               2           4.9          3.0          0.2       setosa
2               3           4.7          3.2          0.2       setosa
3               4           4.6          3.1          0.2       setosa
4               5           5.0          3.6          0.2       setosa

In [93]:
query = '''SELECT * FROM customers
LEFT JOIN contract_types USING(contract_type_id)
LEFT JOIN internet_service_types USING (internet_service_type_id)
LEFT JOIN payment_types USING (payment_type_id)'''
connection = get_connection('telco_churn')

In [94]:
def get_telco_data():
    '''
    get_telco_churn_data will check to see if there is a local csv
    that contains titanic data, if not, will make a sql connection
    based on presented credentials of user, host, and password
    provided from an env.py file
    
    args: none
    return: a single pandas DataFrame
    '''
    # check to see if telco_churn.csv exists in our present directory
    if os.path.exists('telco_churn.csv'):
        #if that check returns the boolean True:
        # read in the file via pd.read_csv
        # and help point to where the index column is
        df = pd.read_csv('telco_churn.csv', index_col=0)
    else:
    #if that file is not here already:
        #define a query as a string-literal
        # that we checked in mysqlworkbench 
        query = '''SELECT * FROM customers
        LEFT JOIN contract_types USING(contract_type_id)
        LEFT JOIN internet_service_types USING (internet_service_type_id)
        LEFT JOIN payment_types USING (payment_type_id)'''
        # define a connection based on our get_connection
        #function that requires a single positional arg
        # associated with the schema name
        connection = get_connection('telco_churn')
        # use pd.read_sql to link that query and connection
        # return that into our variable df
        df = pd.read_sql(query, connection)
        # save the dataframe as a csv so os.path will return True
        # the next time we call the function
        #and it will merely read in the local csv instead of 
        #reconnecting to sql
        df.to_csv('telco_churn.csv')
    #now that we have a df one way or another at this point
    #go ahead and return the dataframe
    #so that we do not run into any funtional scope issues
    return df

In [95]:
telco = get_telco_data()

In [96]:
telco.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

    Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join contract_types, internet_service_types, payment_types tables with the customers table, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.

    Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.